#pragma region Copyright (c) 2014-2016 OpenRCT2 Developers
/*****************************************************************************
 * OpenRCT2, an open source clone of Roller Coaster Tycoon 2.
 *
 * OpenRCT2 is the work of many authors, a full list can be found in contributors.md
 * For more information, visit https://github.com/OpenRCT2/OpenRCT2
 *
 * OpenRCT2 is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * A full copy of the GNU General Public License can be found in licence.txt
 *****************************************************************************/
#pragma endregion

#ifndef _RIDE_H_
#define _RIDE_H_

#include "../addresses.h"
#include "../common.h"
#include "../peep/peep.h"
#include "../world/map.h"
#include "vehicle.h"

typedef fixed16_2dp ride_rating;

// Convenience function for writing ride ratings. The result is a 16 bit signed
// integer. To create the ride rating 3.65 type RIDE_RATING(3,65)
#define RIDE_RATING(whole, fraction)	FIXED_2DP(whole, fraction)

#pragma pack(push, 1)

// Used for return values, for functions that modify all three.
typedef struct rating_tuple {
	ride_rating excitement;
	ride_rating intensity;
	ride_rating nausea;
} rating_tuple;
assert_struct_size(rating_tuple, 6);

/**
 * Couples a ride type and subtype together.
 */
typedef struct ride_list_item {
	union {
		struct {
			uint8 type;
			uint8 entry_index;
		};
		uint16 ride_type_and_entry;
	};
} ride_list_item;
assert_struct_size(ride_list_item, 2);

typedef struct track_colour {
	uint8 main;
	uint8 additional;
	uint8 supports;
} track_colour;
assert_struct_size(track_colour, 3);

typedef struct vehicle_colour {
	uint8 main;
	uint8 additional_1;
	uint8 additional_2;
} vehicle_colour;
assert_struct_size(vehicle_colour, 3);

typedef struct track_colour_preset_list {
	uint8 count;
	track_colour list[256];
} track_colour_preset_list;
assert_struct_size(track_colour_preset_list, (1 + 256 * 3));

typedef struct vehicle_colour_preset_list {
	uint8 count;
	vehicle_colour list[256];
} vehicle_colour_preset_list;
assert_struct_size(vehicle_colour_preset_list, (1 + 256 * 3));

/**
 * Ride type structure.
 * size: unknown
 */
typedef struct rct_ride_entry {
	rct_string_id name;						// 0x000
	rct_string_id description;				// 0x002
	uint32 images_offset;					// 0x004
	uint32 flags;							// 0x008
	uint8 ride_type[3];						// 0x00C
	uint8 min_cars_in_train;				// 0x00F
	uint8 max_cars_in_train;				// 0x010
	uint8 cars_per_flat_ride;				// 0x011
	// Number of cars that can't hold passengers
	uint8 zero_cars;						// 0x012
	// The index to the vehicle type displayed in
	// the vehicle tab.
	uint8 tab_vehicle;						// 0x013
	uint8 default_vehicle;					// 0x014
	// Convert from first - fourth vehicle to
	// vehicle structure
	uint8 front_vehicle;					// 0x015
	uint8 second_vehicle;					// 0x016
	uint8 rear_vehicle;						// 0x017
	uint8 third_vehicle;					// 0x018
	uint8 pad_019;
	rct_ride_entry_vehicle vehicles[4];		// 0x1A
	vehicle_colour_preset_list *vehicle_preset_list;	// 0x1AE
	sint8 excitement_multipler;				// 0x1B2
	sint8 intensity_multipler;				// 0x1B3
	sint8 nausea_multipler;					// 0x1B4
	uint8 max_height;			// 0x1B5
	union {
		uint64 enabledTrackPieces;						// 0x1B6
		struct {
			uint32 enabledTrackPiecesA;					// 0x1B6
			uint32 enabledTrackPiecesB;					// 0x1BA
		};
	};
	uint8 category[2];									// 0x1BE
	uint8 shop_item;									// 0x1C0
	uint8 shop_item_secondary;							// 0x1C1
} rct_ride_entry;
#ifdef PLATFORM_32BIT
assert_struct_size(rct_ride_entry, 0x1c2);
#endif

/**
 * Ride structure.
 * size: 0x0260
 */
typedef struct rct_ride {
	uint8 type;						// 0x000
	// pointer to static info. for example, wild mouse type is 0x36, subtype is
	// 0x4c.
	uint8 subtype;					// 0x001
	uint16 pad_002;
	uint8 mode;						// 0x004
	uint8 colour_scheme_type;		// 0x005
	rct_vehicle_colour vehicle_colours[32];		// 0x006
	uint8 pad_046[0x03];
	// 0 = closed, 1 = open, 2 = test
	uint8 status;					// 0x049
	rct_string_id name;				// 0x04A
	union {
		uint32 name_arguments;		// 0x04C
		struct {
			rct_string_id name_arguments_type_name;		// 0x04C
			uint16 name_arguments_number;				// 0x04E
		};
	};
	uint16 overall_view;			// 0x050 00XX = X, XX00 = Y (* 32 + 16)
	uint16 station_starts[4];		// 0x052
	uint8 station_heights[4];		// 0x05A
	uint8 station_length[4];		// 0x05E
	uint8 station_depart[4];		// 0x062
	// ride->vehicle index for current train waiting for passengers
	// at station
	uint8 train_at_station[4];		// 0x066
	uint16 entrances[4];			// 0x06A
	uint16 exits[4];				// 0x072
	uint16 last_peep_in_queue[4];	// 0x07A
	uint8 pad_082[4];
	uint16 vehicles[32];			// 0x086 Points to the first car in the train
	uint8 depart_flags;				// 0x0C6

	// Not sure if these should be uint or sint.
	uint8 num_stations;				// 0x0C7
	uint8 num_vehicles;				// 0x0C8
	uint8 num_cars_per_train;		// 0x0C9
	uint8 proposed_num_vehicles;	// 0x0CA
	uint8 proposed_num_cars_per_train; // 0x0CB
	uint8 max_trains;				// 0x0CC
	uint8 min_max_cars_per_train;	// 0x0CD
	uint8 min_waiting_time;			// 0x0CE
	uint8 max_waiting_time;			// 0x0CF
	union {
		uint8 operation_option;		// 0x0D0
		uint8 time_limit;			// 0x0D0
		uint8 num_laps;				// 0x0D0
		uint8 launch_speed;			// 0x0D0
		uint8 speed;				// 0x0D0
		uint8 rotations;			// 0x0D0
	};
	uint8 boat_hire_return_direction;	// 0x0D1
	uint16 boat_hire_return_position;	// 0x0D2
	uint8 measurement_index;		// 0x0D4
    // bits 0 through 4 are the number of helix sections
    // bit 5: spinning tunnel, water splash, or rapids
    // bit 6: log reverser, waterfall
    // bit 7: whirlpool
	uint8 special_track_elements;   // 0x0D5
	uint8 pad_0D6[2];
	// Divide this value by 29127 to get the human-readable max speed
	// (in RCT2, display_speed = (max_speed * 9) >> 18)
	sint32 max_speed;				// 0x0D8
	sint32 average_speed;			// 0x0DC
	uint8 current_test_segment;		// 0x0E0
	uint8 average_speed_test_timeout;	// 0x0E1
	uint8 pad_0E2[0x2];
	sint32 length[4];				// 0x0E4
	uint16 time[4];					// 0x0F4
	fixed16_2dp max_positive_vertical_g;	// 0x0FC
	fixed16_2dp max_negative_vertical_g;	// 0x0FE
	fixed16_2dp max_lateral_g;		// 0x100
	fixed16_2dp previous_vertical_g;// 0x102
	fixed16_2dp previous_lateral_g;	// 0x104
	uint8 pad_106[0x2];
	uint32 testing_flags;			// 0x108
	// x y map location of the current track piece during a test
	// this is to prevent counting special tracks multiple times
	rct_xy8 cur_test_track_location;	// 0x10C
	// Next 3 variables are related (XXXX XYYY ZZZa aaaa)
	uint16 turn_count_default;		// 0x10E X = current turn count
	uint16 turn_count_banked;		// 0x110
	uint16 turn_count_sloped;		// 0x112 X = number turns > 3 elements
	union {
		uint8 inversions;			// 0x114 (???X XXXX)
		uint8 holes;				// 0x114 (???X XXXX)
		// The undercover portion is a very rough approximation of how much of the ride is undercover.
		// It reaches the maximum value of 7 at about 50% undercover and doesn't increase beyond that.
		uint8 undercover_portion;	// 0x114 (XXX?-????)
	};
	// Y is number of powered lifts, X is drops
	uint8 drops;					// 0x115 (YYXX XXXX)
	uint8 start_drop_height;		// 0x116
	uint8 highest_drop_height;		// 0x117
	sint32 sheltered_length;		// 0x118
	// Unused always 0? Should affect nausea
	uint16 var_11C;
	uint8 num_sheltered_sections;   // 0x11E (?abY YYYY)
	// see cur_test_track_location
	uint8 cur_test_track_z;			// 0x11F
	// Customer counter in the current 960 game tick (about 30 seconds) interval
	uint16 cur_num_customers;       // 0x120
	// Counts ticks to update customer intervals, resets each 960 game ticks.
	uint16 num_customers_timeout;   // 0x122
	// Customer count in the last 10 * 960 game ticks (sliding window)
	uint16 num_customers[10];       // 0x124
	money16 price;					// 0x138
	rct_xy8 chairlift_bullwheel_location[2]; // 0x13A
	uint8 chairlift_bullwheel_z[2];	// 0x13E
	union {
		rating_tuple ratings;		// 0x140
		struct {
			ride_rating excitement;	// 0x140
			ride_rating intensity;	// 0x142
			ride_rating nausea;		// 0x144
		};
	};
	uint16 value;					// 0x146
	uint16 chairlift_bullwheel_rotation;	// 0x148
	uint8 satisfaction;				// 0x14A
	uint8 satisfaction_time_out;	// 0x14B
	uint8 satisfaction_next;		// 0x14C
	// Various flags stating whether a window needs to be refreshed
	uint8 window_invalidate_flags;	// 0x14D
	uint8 pad_14E[0x02];
	uint32 total_customers;			// 0x150
	money32 total_profit;			// 0x154
	uint8 popularity;				// 0x158
	uint8 popularity_time_out;		// 0x159 Updated every purchase and ?possibly by time?
	uint8 popularity_next;			// 0x15A When timeout reached this will be the next popularity
	uint8 num_riders;				// 0x15B
	uint8 music_tune_id;			// 0x15C
	uint8 slide_in_use;				// 0x15D
	union {
		uint16 slide_peep;			// 0x15E
		uint16 maze_tiles;			// 0x15E
	};
	uint8 pad_160[0xE];
	uint8 slide_peep_t_shirt_colour;// 0x16E
	uint8 pad_16F[0x7];
	uint8 spiral_slide_progress;	// 0x176
	uint8 pad_177[0x9];
	sint16 build_date;				// 0x180
	money16 upkeep_cost;			// 0x182
	uint16 race_winner;				// 0x184
	uint8 pad_186[0x02];
	uint32 music_position;			// 0x188
	uint8 breakdown_reason_pending;	// 0x18C
	uint8 mechanic_status;			// 0x18D
	uint16 mechanic;				// 0x18E
	uint8 inspection_station;		// 0x190
	uint8 broken_vehicle;			// 0x191
	uint8 broken_car;				// 0x192
	uint8 breakdown_reason;			// 0x193
	money16 price_secondary;		// 0x194
	// Starts at RIDE_INITIAL_RELIABILITY and decreases from there. Right shift
	// this number by 8 to get a reliability percentage 0-100
	uint16 reliability;				// 0x196
	// Small constant used to increase the unreliability as the game continues,
	// making breakdowns more and more likely.
	uint8 unreliability_factor;		// 0x198
	// Range from [0, 100]
	uint8 downtime;                 // 0x199
	uint8 inspection_interval;		// 0x19A
	uint8 last_inspection;			// 0x19B
	uint8 downtime_history[8];		// 0x19C
	uint32 no_primary_items_sold;	// 0x1A4
	uint32 no_secondary_items_sold; // 0x1A8
	uint8 breakdown_sound_modifier;	// 0x1AC 
	// Used to oscilate the sound when ride breaks down.
	// 0 = no change, 255 = max change
	uint8 not_fixed_timeout;		// 0x1AD
	uint8 last_crash_type;			// 0x1AE
	uint8 connected_message_throttle;	// 0x1AF
	money32 income_per_hour;		// 0x1B0
	money32 profit;					// 0x1B4
	uint8 queue_time[4];			// 0x1B8
	uint8 track_colour_main[4];		// 0x1BC
	uint8 track_colour_additional[4];	// 0x1C0
	uint8 track_colour_supports[4];	// 0x1C4
	uint8 music;					// 0x1C8
	uint8 entrance_style;			// 0x1C9
	uint16 vehicle_change_timeout;	// 0x1CA
	uint8 num_block_brakes;			// 0x1CC
	uint8 lift_hill_speed;			// 0x1CD
	uint16 guests_favourite;		// 0x1CE
	uint32 lifecycle_flags;			// 0x1D0
	uint8 vehicle_colours_extended[32];	// 0x1D4
	uint16 total_air_time;			// 0x1F4
	uint8 current_test_station;		// 0x1F6
	uint8 num_circuits;				// 0x1F7
	sint16 cable_lift_x;			// 0x1F8
	sint16 cable_lift_y;			// 0x1FA
	uint8 cable_lift_z;				// 0x1FC
	uint8 pad_1FD;
	uint16 cable_lift;				// 0x1FE
	uint16 queue_length[4];			// 0x200
	uint8 pad_208[0x58];
} rct_ride;
assert_struct_size(rct_ride, 0x260);

#define RIDE_MEASUREMENT_MAX_ITEMS 4800

/**
 * Ride measurement structure.
 * size: 0x04B0C
 */
typedef struct rct_ride_measurement {
	uint8 ride_index;							// 0x0000
	uint8 flags;								// 0x0001
	uint32 last_use_tick;						// 0x0002
	uint16 num_items;							// 0x0006
	uint16 current_item;						// 0x0008
	uint8 vehicle_index;						// 0x000A
	uint8 current_station;						// 0x000B
	sint8 vertical[RIDE_MEASUREMENT_MAX_ITEMS];	// 0x000C
	sint8 lateral[RIDE_MEASUREMENT_MAX_ITEMS];	// 0x12CC
	uint8 velocity[RIDE_MEASUREMENT_MAX_ITEMS];	// 0x258C
	uint8 altitude[RIDE_MEASUREMENT_MAX_ITEMS];	// 0x384C
} rct_ride_measurement;
assert_struct_size(rct_ride_measurement, 0x4b0c);

typedef struct track_begin_end {
	int begin_x;
	int begin_y;
	int begin_z;
	int begin_direction;
	rct_map_element *begin_element;
	int end_x;
	int end_y;
	int end_direction;
	rct_map_element *end_element;
} track_begin_end;
#ifdef PLATFORM_32BIT
assert_struct_size(track_begin_end, 36);
#endif

#pragma pack(pop)

/*
 * This array should probably be only 91 + 128 * 3 = 475 bytes long.
 * It was originally stored at address 0x009E32F8 and continued until 0x009E34E3
 * (inclusive). 0x009E34E4 is the address of s6 header, so it's likely it had
 * some padding at the end as well.
 */
#define TYPE_TO_RIDE_ENTRY_SLOTS 492
extern uint8 gTypeToRideEntryIndexMap[TYPE_TO_RIDE_ENTRY_SLOTS];

enum {
	RIDE_CLASS_RIDE,
	RIDE_CLASS_SHOP_OR_STALL,
	RIDE_CLASS_KIOSK_OR_FACILITY
};

// Constants used by the lifecycle_flags property at 0x1D0
enum {
