/*****************************************************************************
 * Copyright (c) 2014 Ted John, Peter Hill
 * OpenRCT2, an open source clone of Roller Coaster Tycoon 2.
 *
 * This file is part of OpenRCT2.
 *
 * OpenRCT2 is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 *****************************************************************************/

#ifndef _RIDE_H_
#define _RIDE_H_

#include "../addresses.h"
#include "../common.h"
#include "../peep/peep.h"
#include "../world/map.h"
#include "vehicle.h"

typedef fixed16_2dp ride_rating;

// Convenience function for writing ride ratings. The result is a 16 bit signed
// integer. To create the ride rating 3.65 type RIDE_RATING(3,65)
#define RIDE_RATING(whole, fraction)	FIXED_2DP(whole, fraction)

// Used for return values, for functions that modify all three.
typedef struct {
	ride_rating excitement;
	ride_rating intensity;
	ride_rating nausea;
} rating_tuple;

/**
 * Couples a ride type and subtype together.
 */
typedef struct {
	uint8 type;
	uint8 entry_index;
} ride_list_item;

/** 
 * Ride type vehicle structure.
 * size: 0x65
 */
typedef struct{
	uint16 var_00;				// 0x00 , 0x1A
	uint8 var_02;				// 0x02 , 0x1C
	uint8 var_03;				// 0x03 , 0x1D
	uint32 var_04;				// 0x04 , 0x1E
	uint16 var_08;				// 0x08 , 0x22
	sint8 var_0A;				// 0x0A , 0x24
	uint8 pad_0B;
	uint16 var_0C;				// 0x0C , 0x26
	uint8 var_0E;				// 0x0E , 0x28
	uint8 var_0F;				// 0x0F , 0x29
	uint8 var_10;				// 0x10 , 0x2A
	uint8 var_11;				// 0x11 , 0x2B
	uint16 var_12;				// 0x12 , 0x2C
	uint16 var_14;				// 0x14 , 0x2E
	uint16 var_16;				// 0x16 , 0x30
	uint32 base_image_id;		// 0x18 , 0x32
	uint32 var_1C;				// 0x1C , 0x36
	uint32 var_20;				// 0x20 , 0x3A
	uint32 var_24;				// 0x24 , 0x3E
	uint32 var_28;				// 0x28 , 0x42
	uint32 var_2C;				// 0x2C , 0x46
	uint32 var_30;				// 0x30 , 0x4A
	uint32 var_34;				// 0x34 , 0x4E
	uint32 var_38;				// 0x38 , 0x52
	uint32 var_3C;				// 0x3C , 0x56
	uint32 var_40;				// 0x40 , 0x5A
	uint32 var_44;				// 0x44 , 0x5E
	uint32 var_48;				// 0x48 , 0x62
	uint32 var_4C;				// 0x4C , 0x66
	uint32 no_vehicle_images;	// 0x50 , 0x6A
	uint8 no_seating_rows;		// 0x54 , 0x6E
	uint8 pad_55[0x5];
	uint8 var_5A;				// 0x5A , 0x74
	uint8 pad_5B;				// 0x5B , 0x75
	uint8 var_5C;				// 0x5C , 0x76
	uint8 var_5D;				// 0x5D , 0x77
	uint8 pad_5E[0x2];
	uint8 var_60;				// 0x60 , 0x7A
	sint8* peep_loading_positions;	// 0x61 , 0x7B
} rct_ride_type_vehicle;

/**
 * Ride type structure.
 * size: unknown
 */
typedef struct {
	rct_string_id name;						// 0x000
	rct_string_id description;				// 0x002
	uint32 images_offset;					// 0x004
	uint32 flags;							// 0x008
	uint8 ride_type[3];						// 0x00C
	uint8 min_cars_in_train;				// 0x00F
	uint8 max_cars_in_train;				// 0x010
	uint8 cars_per_flat_ride;				// 0x011
	uint8 zero_cars;						// 0x012
	uint8 tab_vehicle;						// 0x013
	uint8 default_vehicle;					// 0x014
	uint8 front_vehicle;					// 0x015
	uint8 second_vehicle;					// 0x016
	uint8 rear_vehicle;						// 0x017
	uint8 third_vehicle;					// 0x018
	uint8 pad_019;
	rct_ride_type_vehicle vehicles[4];		// 0x1A
	uint32 var_1AE;
	sint8 excitement_multipler;				// 0x1B2
	sint8 intensity_multipler;				// 0x1B3
	sint8 nausea_multipler;					// 0x1B4
	uint8 max_height;						// 0x1B5
	union {
		uint64 enabledTrackPieces;			// 0x1B6
		struct {
			uint32 enabledTrackPiecesA;		// 0x1B6
			uint32 enabledTrackPiecesB;		// 0x1BA
		};
	};
	uint8 category[2];						// 0x1BE
	uint8 shop_item;						// 0x1C0
	uint8 shop_item_secondary;				// 0x1C1
} rct_ride_type;

/**
 * Ride structure.
 * size: 0x0260
 */
typedef struct {
	uint8 type;						// 0x000
	// pointer to static info. for example, wild mouse type is 0x36, subtype is
	// 0x4c.
	uint8 subtype;					// 0x001
	uint16 pad_002;
	uint8 mode;						// 0x004
	uint8 colour_scheme_type;		// 0x005
	rct_vehicle_colour vehicle_colours[32];		// 0x006
	uint8 pad_046[0x03];
	// 0 = closed, 1 = open, 2 = test
	uint8 status;					// 0x049
	rct_string_id name;				// 0x04A
	union {
		uint32 name_arguments;		// 0x04C
		struct {
			rct_string_id name_arguments_type_name;		// 0x04C
			uint16 name_arguments_number;				// 0x04E
		};
	};
	uint16 overall_view;			// 0x050 00XX = X, XX00 = Y (* 32 + 16)
	uint16 station_starts[4];		// 0x052
	uint8 station_heights[4];		// 0x05A
	uint8 station_length[4];		// 0x05E
	uint8 station_depart[4];		// 0x062
	uint8 var_066[4];
	uint16 entrances[4];			// 0x06A
	uint16 exits[4];				// 0x072
	uint16 first_peep_in_queue[4];	// 0x07A
	uint8 pad_082[4];
	uint16 vehicles[32];			// 0x086 Points to the first car in the train
	uint8 depart_flags;				// 0x0C6

	// Not sure if these should be uint or sint.
	uint8 num_stations;				// 0x0C7
	uint8 num_vehicles;				// 0x0C8
	uint8 num_cars_per_train;		// 0x0C9
	uint8 var_0CA;
	uint8 var_0CB;
	uint8 max_trains;				// 0x0CC
	uint8 min_max_cars_per_train;	// 0x0CD
	uint8 min_waiting_time;			// 0x0CE
	uint8 max_waiting_time;			// 0x0CF
	union {
		uint8 operation_option;		// 0x0D0
		uint8 time_limit;			// 0x0D0
		uint8 num_laps;				// 0x0D0
		uint8 launch_speed;			// 0x0D0
		uint8 speed;				// 0x0D0
		uint8 rotations;			// 0x0D0
	};
	uint8 pad_0D1[0x3];
	uint8 measurement_index;		// 0x0D4
    // bits 0 through 4 are the number of helix sections
    // bit 5: spinning tunnel, water splash, or rapids
    // bit 6: log reverser, waterfall
    // bit 7: whirlpool
	uint8 special_track_elements;   // 0x0D5
	uint8 pad_0D6[2];
	// Divide this value by 29127 to get the human-readable max speed 
	// (in RCT2, display_speed = (max_speed * 9) >> 18)
	sint32 max_speed;				// 0x0D8
	sint32 average_speed;			// 0x0DC
	uint8 pad_0E0[4];
	sint32 length[4];				// 0x0E4
	uint16 time[4];					// 0x0F4
	fixed16_2dp max_positive_vertical_g;	// 0x0FC
	fixed16_2dp max_negative_vertical_g;	// 0x0FE
	fixed16_2dp max_lateral_g;		// 0x100
	uint8 pad_102[0xC];
	uint16 var_10E;
	uint16 var_110;
	uint16 var_112;
	union {
		uint8 inversions;			// 0x114 (???X XXXX)
		uint8 holes;				// 0x114 (???X XXXX)
	};
	uint8 drops;					// 0x115 (??XX XXXX)
	uint8 var_116;
	uint8 highest_drop_height;		// 0x117
	sint32 sheltered_length;		// 0x118
	uint8 pad_11C[0x2];
	uint8 num_sheltered_sections;   // 0x11E
	uint8 var_11F;
	sint16 var_120;
	sint16 var_122;
	sint16 var_124;
	sint16 var_126;
	sint16 var_128;
	sint16 var_12A;
	sint16 var_12C;
	sint16 var_12E;
	uint16 age;						// 0x130
	sint16 running_cost;			// 0x132
	sint16 var_134;
	sint16 var_136;
	money16 price;					// 0x138
	sint16 var_13A;
	sint16 var_13C;
	uint8 var_13E;
	uint8 var_13F;
	union {
		rating_tuple ratings;		// 0x140
		struct {
			ride_rating excitement;	// 0x140
			ride_rating intensity;	// 0x142
			ride_rating nausea;		// 0x144
		};
	};
	uint16 value;					// 0x146
	uint16 var_148;
	uint8 satisfaction;				// 0x14A
	uint8 satisfaction_time_out;	// 0x14B
	uint8 satisfaction_next;		// 0x14C
	// Various flags stating whether a window needs to be refreshed
	uint8 window_invalidate_flags;	// 0x14D
	uint8 pad_14E[0x02];
	uint32 total_customers;			// 0x150
	money32 total_profit;			// 0x154
	uint8 popularity;				// 0x158
	uint8 popularity_time_out;		// 0x159 Updated every purchase and ?possibly by time?
	uint8 popularity_next;			// 0x15A When timeout reached this will be the next popularity
	uint8 num_riders;				// 0x15B
	uint8 music_tune_id;			// 0x15C
	uint8 var_15D;
	union {
		uint16 slide_peep;			// 0x15E
		uint16 maze_tiles;			// 0x15E
	};
	uint8 pad_160[0xE];
	uint8 slide_peep_t_shirt_colour;// 0x16E
	uint8 pad_16F[0x7];
	uint8 var_176;
	uint8 pad_177[0x9];
	sint16 build_date;				// 0x180
	money16 upkeep_cost;			// 0x182
	uint16 race_winner;				// 0x184
	uint8 pad_186[0x02];
	uint32 music_position;			// 0x188
	uint8 breakdown_reason_pending;	// 0x18C
	uint8 mechanic_status;			// 0x18D
	uint16 mechanic;				// 0x18E
	uint8 inspection_station;		// 0x190
	uint8 broken_vehicle;			// 0x191
	uint8 broken_car;				// 0x192
	uint8 breakdown_reason;			// 0x193
	money16 price_secondary;		// 0x194
	// Starts at RIDE_INITIAL_RELIABILITY and decreases from there. Right shift
	// this number by 8 to get a reliability percentage 0-100
	uint16 reliability;				// 0x196
	// Small constant used to increase the unreliability as the game continues,
	// making breakdowns more and more likely.
	uint8 unreliability_factor;		// 0x198
	// Range from [0, 100]
	uint8 downtime;                 // 0x199
	uint8 inspection_interval;		// 0x19A
	uint8 last_inspection;			// 0x19B
	uint8 var_19C;
	uint8 var_19D;
	uint8 var_19E;
	uint8 var_19F;
	uint8 var_1A0;
	uint8 var_1A1;
	uint8 var_1A2;
	uint8 var_1A3;
	uint32 no_primary_items_sold;	// 0x1A4
	uint32 no_secondary_items_sold; // 0x1A8
	uint8 var_1AC;
	uint8 var_1AD;
	uint8 last_crash_type;			// 0x1AE
	uint8 connected_message_throttle;	// 0x1AF
	money32 income_per_hour;		// 0x1B0
	money32 profit;					// 0x1B4
	uint8 queue_time[4];			// 0x1B8
	uint8 track_colour_main[4];		// 0x1BC
	uint8 track_colour_additional[4];	// 0x1C0
	uint8 track_colour_supports[4];	// 0x1C4
	uint8 music;					// 0x1C8
	uint8 entrance_style;			// 0x1C9
	uint16 var_1CA;
	uint8 num_block_brakes;			// 0x1CC
	uint8 lift_hill_speed;			// 0x1CD
	uint16 guests_favourite;		// 0x1CE
	uint32 lifecycle_flags;			// 0x1D0
	uint8 vehicle_colours_extended[32];	// 0x1D4
	uint16 total_air_time;			// 0x1F4
	uint8 pad_1F6;
	uint8 num_circuits;				// 0x1F7
	sint16 var_1F8;
	sint16 var_1FA;
	uint8 var_1FC;
	uint8 pad_1FD;
	uint16 cable_lift;				// 0x1FE
	uint16 queue_length[4];			// 0x200
	uint8 pad_208[0x58];
} rct_ride;

#define RIDE_MEASUREMENT_MAX_ITEMS 4800

/**
 * Ride measurement structure.
 * size: 0x04B0C
 */
typedef struct {
	uint8 ride_index;							// 0x0000
	uint8 flags;								// 0x0001
	uint32 last_use_tick;						// 0x0002
	uint16 num_items;							// 0x0006
	uint16 current_item;						// 0x0008
	uint8 vehicle_index;						// 0x000A
	uint8 current_station;						// 0x000B
	sint8 vertical[RIDE_MEASUREMENT_MAX_ITEMS];	// 0x000C
	sint8 lateral[RIDE_MEASUREMENT_MAX_ITEMS];	// 0x12CC
	uint8 velocity[RIDE_MEASUREMENT_MAX_ITEMS];	// 0x258C
	uint8 altitude[RIDE_MEASUREMENT_MAX_ITEMS];	// 0x384C
} rct_ride_measurement;

typedef struct {
	int begin_x;
	int begin_y;
	int begin_z;
	int begin_direction;
	rct_map_element *begin_element;
	int end_x;
	int end_y;
	int end_direction;
	rct_map_element *end_element;
} track_begin_end;

enum {
	RIDE_CLASS_RIDE,
	RIDE_CLASS_SHOP_OR_STALL,
	RIDE_CLASS_KIOSK_OR_FACILITY
};

// Constants used by the lifecycle_flags property at 0x1D0
enum {
	RIDE_LIFECYCLE_ON_TRACK = 1 << 0,
	RIDE_LIFECYCLE_TESTED = 1 << 1,
	RIDE_LIFECYCLE_TEST_IN_PROGRESS = 1 << 2,
	RIDE_LIFECYCLE_NO_RAW_STATS = 1 << 3,
	RIDE_LIFECYCLE_PASS_STATION_NO_STOPPING = 1 << 4,
	RIDE_LIFECYCLE_ON_RIDE_PHOTO = 1 << 5,
	RIDE_LIFECYCLE_BREAKDOWN_PENDING = 1 << 6,
	RIDE_LIFECYCLE_BROKEN_DOWN = 1 << 7,
	RIDE_LIFECYCLE_DUE_INSPECTION = 1 << 8,

	RIDE_LIFECYCLE_CRASHED = 1 << 10,
	RIDE_LIFECYCLE_11 = 1 << 11,
	RIDE_LIFECYCLE_EVER_BEEN_OPENED = 1 << 12,
	RIDE_LIFECYCLE_MUSIC = 1 << 13,
	RIDE_LIFECYCLE_INDESTRUCTIBLE = 1 << 14,
