#pragma region Copyright (c) 2014-2017 OpenRCT2 Developers
/*****************************************************************************
 * OpenRCT2, an open source clone of Roller Coaster Tycoon 2.
 *
 * OpenRCT2 is the work of many authors, a full list can be found in contributors.md
 * For more information, visit https://github.com/OpenRCT2/OpenRCT2
 *
 * OpenRCT2 is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * A full copy of the GNU General Public License can be found in licence.txt
 *****************************************************************************/
#pragma endregion

#ifndef _RIDE_H_
#define _RIDE_H_

#include "../common.h"
#include "../peep/Peep.h"
#include "../rct12/RCT12.h"
#include "../rct2/RCT2.h"
#include "../world/Map.h"
#include "RideRatings.h"
#include "Vehicle.h"

interface IObjectManager;

#define MAX_RIDE_TYPES_PER_RIDE_ENTRY   3
// The max number of different types of vehicle.
// Examples of vehicles here are the locomotive, tender and carriage of the Miniature Railway.
#define MAX_VEHICLES_PER_RIDE_ENTRY     4
#define MAX_VEHICLES_PER_RIDE           32
#define RIDE_ENTRY_INDEX_NULL           255
#define NUM_COLOUR_SCHEMES              4
#define MAX_CATEGORIES_PER_RIDE         2
#define DOWNTIME_HISTORY_SIZE           8
#define CUSTOMER_HISTORY_SIZE           10
#define MAX_CARS_PER_TRAIN              255
#define MAX_STATIONS                    4
#define RIDE_MEASUREMENT_MAX_ITEMS      4800
#define MAX_RIDES                       255
#define RIDE_ID_NULL                    255
#define RIDE_ADJACENCY_CHECK_DISTANCE   5

#pragma pack(push, 1)

/**
 * Couples a ride type and subtype together.
 */
struct ride_list_item {
    union {
        struct {
            uint8 type;
            uint8 entry_index;
        };
        uint16 ride_type_and_entry;
    };
};
assert_struct_size(ride_list_item, 2);

struct track_colour {
    uint8 main;
    uint8 additional;
    uint8 supports;
};
assert_struct_size(track_colour, 3);

struct vehicle_colour {
    uint8 main;
    uint8 additional_1;
    uint8 additional_2;
};
assert_struct_size(vehicle_colour, 3);

struct track_colour_preset_list {
    uint8 count;
    track_colour list[256];
};
assert_struct_size(track_colour_preset_list, (1 + 256 * 3));

struct vehicle_colour_preset_list {
    uint8 count;
    vehicle_colour list[256];
};
assert_struct_size(vehicle_colour_preset_list, (1 + 256 * 3));

struct rct_ride_name {
    rct_string_id name;
    rct_string_id description;
};
assert_struct_size(rct_ride_name, 4);

/**
 * Ride type structure.
 * size: unknown
 */
struct rct_ride_entry {
    rct_ride_name naming;
    uint32 images_offset;                               // 0x004. The first three images are previews. They correspond to the ride_type[] array.
    uint32 flags;                                       // 0x008
    uint8 ride_type[RCT2_MAX_RIDE_TYPES_PER_RIDE_ENTRY];// 0x00C
    uint8 min_cars_in_train;                            // 0x00F
    uint8 max_cars_in_train;                            // 0x010
    uint8 cars_per_flat_ride;                           // 0x011
    // Number of cars that can't hold passengers
    uint8 zero_cars;                                    // 0x012
    // The index to the vehicle type displayed in
    // the vehicle tab.
    uint8 tab_vehicle;                                  // 0x013
    uint8 default_vehicle;                              // 0x014
    // Convert from first - fourth vehicle to
    // vehicle structure
    uint8 front_vehicle;                                // 0x015
    uint8 second_vehicle;                               // 0x016
    uint8 rear_vehicle;                                 // 0x017
    uint8 third_vehicle;                                // 0x018
    uint8 pad_019;                                      // 0x019
    rct_ride_entry_vehicle vehicles[RCT2_MAX_VEHICLES_PER_RIDE_ENTRY]; // 0x01A
    vehicle_colour_preset_list *vehicle_preset_list;    // 0x1AE
    sint8 excitement_multiplier;                        // 0x1B2
    sint8 intensity_multiplier;                         // 0x1B3
    sint8 nausea_multiplier;                            // 0x1B4
    uint8 max_height;                                   // 0x1B5
    uint64 enabledTrackPieces;                          // 0x1B6
    uint8 category[RCT2_MAX_CATEGORIES_PER_RIDE];       // 0x1BE
    uint8 shop_item;                                    // 0x1C0
    uint8 shop_item_secondary;                          // 0x1C1
    rct_string_id capacity;
    void * obj;
};

#pragma pack(pop)

/**
 * Ride structure.
 *
 * This is based on RCT2's ride structure.
 * Padding and no longer used fields have been removed.
 */
struct Ride 
{
    uint8 type;
    // pointer to static info. for example, wild mouse type is 0x36, subtype is
    // 0x4c.
    uint8 subtype;
    uint8 mode;
    uint8 colour_scheme_type;
    rct_vehicle_colour vehicle_colours[MAX_CARS_PER_TRAIN];
    // 0 = closed, 1 = open, 2 = test
    uint8 status;
    rct_string_id name;
    union {
        uint32 name_arguments;
        struct {
            rct_string_id name_arguments_type_name;
            uint16 name_arguments_number;
        };
    };
    LocationXY8 overall_view;
    LocationXY8 station_starts[MAX_STATIONS];
    uint8 station_heights[MAX_STATIONS];
    uint8 station_length[MAX_STATIONS];
    uint8 station_depart[MAX_STATIONS];
    // ride->vehicle index for current train waiting for passengers
    // at station
    uint8 train_at_station[MAX_STATIONS];
    TileCoordsXYZD entrances[MAX_STATIONS];
    TileCoordsXYZD exits[MAX_STATIONS];
    uint16 last_peep_in_queue[MAX_STATIONS];
    uint16 vehicles[MAX_VEHICLES_PER_RIDE];                         // Points to the first car in the train
    uint8 depart_flags;
    uint8 num_stations;
    uint8 num_vehicles;
    uint8 num_cars_per_train;
    uint8 proposed_num_vehicles;
    uint8 proposed_num_cars_per_train;
    uint8 max_trains;
    uint8 min_max_cars_per_train;
    uint8 min_waiting_time;
    uint8 max_waiting_time;
    union {
        uint8 operation_option;
        uint8 time_limit;
        uint8 num_laps;
        uint8 launch_speed;
        uint8 speed;
        uint8 rotations;
    };

    uint8 boat_hire_return_direction;
    LocationXY8 boat_hire_return_position;
    uint8 measurement_index;
    // bits 0 through 4 are the number of helix sections
    // bit 5: spinning tunnel, water splash, or rapids
    // bit 6: log reverser, waterfall
    // bit 7: whirlpool
    uint8 special_track_elements;
    // Divide this value by 29127 to get the human-readable max speed
    // (in RCT2, display_speed = (max_speed * 9) >> 18)
    sint32 max_speed;
    sint32 average_speed;
    uint8 current_test_segment;
    uint8 average_speed_test_timeout;
    sint32 length[MAX_STATIONS];
    uint16 time[MAX_STATIONS];
    fixed16_2dp max_positive_vertical_g;
    fixed16_2dp max_negative_vertical_g;
    fixed16_2dp max_lateral_g;
    fixed16_2dp previous_vertical_g;
    fixed16_2dp previous_lateral_g;
    uint32 testing_flags;
    // x y map location of the current track piece during a test
    // this is to prevent counting special tracks multiple times
    LocationXY8 cur_test_track_location;
    // Next 3 variables are related (XXXX XYYY ZZZa aaaa)
    uint16 turn_count_default;                                      // X = current turn count
    uint16 turn_count_banked;
    uint16 turn_count_sloped;                                       // X = number turns > 3 elements
    union {
        uint8 inversions;                                           // (???X XXXX)
        uint8 holes;                                                // (???X XXXX)
        // This is a very rough approximation of how much of the ride is undercover.
        // It reaches the maximum value of 7 at about 50% undercover and doesn't increase beyond that.
        uint8 sheltered_eighths;                                    // (XXX?-????)
    };
    // Y is number of powered lifts, X is drops
    uint8 drops;                                                    // (YYXX XXXX)
    uint8 start_drop_height;
    uint8 highest_drop_height;
    sint32 sheltered_length;
    // Unused always 0? Should affect nausea
    uint16 var_11C;
    uint8 num_sheltered_sections;                                   // (?abY YYYY)
    // see cur_test_track_location
    uint8 cur_test_track_z;
    // Customer counter in the current 960 game tick (about 30 seconds) interval
    uint16 cur_num_customers;
    // Counts ticks to update customer intervals, resets each 960 game ticks.
    uint16 num_customers_timeout;
    // Customer count in the last 10 * 960 game ticks (sliding window)
    uint16 num_customers[CUSTOMER_HISTORY_SIZE];
    money16 price;
    LocationXY8 chairlift_bullwheel_location[2];
    uint8 chairlift_bullwheel_z[2];
    union {
        rating_tuple ratings;
        struct {
            ride_rating excitement;
            ride_rating intensity;
            ride_rating nausea;
        };
    };
    uint16 value;
    uint16 chairlift_bullwheel_rotation;
    uint8 satisfaction;
    uint8 satisfaction_time_out;
    uint8 satisfaction_next;
    // Various flags stating whether a window needs to be refreshed
    uint8 window_invalidate_flags;
    uint32 total_customers;
    money32 total_profit;
    uint8 popularity;
    uint8 popularity_time_out;                                      // Updated every purchase and ?possibly by time?
    uint8 popularity_next;                                          // When timeout reached this will be the next popularity
    uint16 num_riders;
    uint8 music_tune_id;
    uint8 slide_in_use;
    union {
        uint16 slide_peep;
        uint16 maze_tiles;
    };
    uint8 slide_peep_t_shirt_colour;
    uint8 spiral_slide_progress;
    sint16 build_date;
    money16 upkeep_cost;
    uint16 race_winner;
    uint32 music_position;
    uint8 breakdown_reason_pending;
    uint8 mechanic_status;
    uint16 mechanic;
    uint8 inspection_station;
    uint8 broken_vehicle;
    uint8 broken_car;
    uint8 breakdown_reason;
    money16 price_secondary;
    union
    {
        struct
        {
            uint8 reliability_subvalue;                             // 0 - 255, acts like the decimals for reliability_percentage
            uint8 reliability_percentage;                           // Starts at 100 and decreases from there.
        };
        uint16 reliability;
    };
    // Small constant used to increase the unreliability as the game continues,
    // making breakdowns more and more likely.
    uint8 unreliability_factor;
    // Range from [0, 100]
    uint8 downtime;
    uint8 inspection_interval;
    uint8 last_inspection;
    uint8 downtime_history[DOWNTIME_HISTORY_SIZE];
    uint32 no_primary_items_sold;
    uint32 no_secondary_items_sold;
    uint8 breakdown_sound_modifier;
    // Used to oscillate the sound when ride breaks down.
    // 0 = no change, 255 = max change
    uint8 not_fixed_timeout;
    uint8 last_crash_type;
    uint8 connected_message_throttle;
    money32 income_per_hour;
    money32 profit;
    uint8 queue_time[MAX_STATIONS];
    uint8 track_colour_main[NUM_COLOUR_SCHEMES];
    uint8 track_colour_additional[NUM_COLOUR_SCHEMES];
    uint8 track_colour_supports[NUM_COLOUR_SCHEMES];
    uint8 music;
    uint8 entrance_style;
    uint16 vehicle_change_timeout;
    uint8 num_block_brakes;
    uint8 lift_hill_speed;
    uint16 guests_favourite;
    uint32 lifecycle_flags;
    uint8 vehicle_colours_extended[MAX_CARS_PER_TRAIN];
    uint16 total_air_time;
    uint8 current_test_station;
    uint8 num_circuits;
    sint16 cable_lift_x;
    sint16 cable_lift_y;
    uint8 cable_lift_z;
    uint16 cable_lift;
    uint16 queue_length[MAX_STATIONS];
};

#pragma pack(push, 1)

/**
 * Ride measurement structure.
 * size: 0x04B0C
 */
struct rct_ride_measurement {
    uint8 ride_index;                           // 0x0000
    uint8 flags;                                // 0x0001
    uint32 last_use_tick;                       // 0x0002
    uint16 num_items;                           // 0x0006
    uint16 current_item;                        // 0x0008
    uint8 vehicle_index;                        // 0x000A
    uint8 current_station;                      // 0x000B
    sint8 vertical[RIDE_MEASUREMENT_MAX_ITEMS]; // 0x000C
    sint8 lateral[RIDE_MEASUREMENT_MAX_ITEMS];  // 0x12CC
    uint8 velocity[RIDE_MEASUREMENT_MAX_ITEMS]; // 0x258C
    uint8 altitude[RIDE_MEASUREMENT_MAX_ITEMS]; // 0x384C
};
assert_struct_size(rct_ride_measurement, 0x4b0c);

struct track_begin_end {
    sint32 begin_x;
    sint32 begin_y;
    sint32 begin_z;
    sint32 begin_direction;
    rct_tile_element *begin_element;
    sint32 end_x;
    sint32 end_y;
    sint32 end_direction;
    rct_tile_element *end_element;
};
#ifdef PLATFORM_32BIT
assert_struct_size(track_begin_end, 36);
#endif

struct ride_name_args {
    uint16 type_name;
    uint16 number;
};
assert_struct_size(ride_name_args, 4);

#pragma pack(pop)

/*
 * This array should probably be only 91 + 128 * 3 = 475 bytes long.
 * It was originally stored at address 0x009E32F8 and continued until 0x009E34E3
 * (inclusive). 0x009E34E4 is the address of s6 header, so it's likely it had
 * some padding at the end as well.
 */
#define TYPE_TO_RIDE_ENTRY_SLOTS 492
extern uint8 gTypeToRideEntryIndexMap[TYPE_TO_RIDE_ENTRY_SLOTS];

enum {
    RIDE_CLASS_RIDE,
    RIDE_CLASS_SHOP_OR_STALL,
