/*****************************************************************************
 * Copyright (c) 2014-2018 OpenRCT2 developers
 *
 * For a complete list of all authors, please refer to contributors.md
 * Interested in contributing? Visit https://github.com/OpenRCT2/OpenRCT2
 *
 * OpenRCT2 is licensed under the GNU General Public License version 3.
 *****************************************************************************/

#ifndef _PEEP_H_
#define _PEEP_H_

#include "../common.h"
#include "../rct12/RCT12.h"
#include "../world/Location.hpp"

#define PEEP_MAX_THOUGHTS 5
#define PEEP_THOUGHT_ITEM_NONE 255

#define PEEP_HUNGER_WARNING_THRESHOLD 25
#define PEEP_THIRST_WARNING_THRESHOLD 25
#define PEEP_BATHROOM_WARNING_THRESHOLD 28
#define PEEP_LITTER_WARNING_THRESHOLD 23
#define PEEP_DISGUST_WARNING_THRESHOLD 22
#define PEEP_VANDALISM_WARNING_THRESHOLD 15
#define PEEP_NOEXIT_WARNING_THRESHOLD 8
#define PEEP_LOST_WARNING_THRESHOLD 8

#define PEEP_MAX_HAPPINESS 255
#define PEEP_MIN_ENERGY 32
#define PEEP_MAX_ENERGY 128
#define PEEP_MAX_ENERGY_TARGET 255 // Oddly, this differs from max energy!

struct rct_tile_element;
struct Ride;

enum PEEP_TYPE
{
    PEEP_TYPE_GUEST,
    PEEP_TYPE_STAFF
};

enum PEEP_THOUGHT_TYPE
{
    PEEP_THOUGHT_TYPE_CANT_AFFORD_0     = 0,  // "I can't afford"
    PEEP_THOUGHT_TYPE_SPENT_MONEY       = 1,  // "I've spent all my money"
    PEEP_THOUGHT_TYPE_SICK              = 2,  // "I feel sick"

    PEEP_ITEM_EMPTY_JUICE_CUP    = (1 << 19),
    PEEP_ITEM_ROAST_SAUSAGE      = (1 << 20),
    PEEP_ITEM_EMPTY_BOWL_BLUE    = (1 << 21)
};

enum PEEP_SPRITE_TYPE
{
    PEEP_SPRITE_TYPE_NORMAL                = 0,
    PEEP_SPRITE_TYPE_HANDYMAN              = 1,
    PEEP_SPRITE_TYPE_MECHANIC              = 2,
    PEEP_SPRITE_TYPE_SECURITY              = 3,
    PEEP_SPRITE_TYPE_ENTERTAINER_PANDA     = 4,
    PEEP_SPRITE_TYPE_ENTERTAINER_TIGER     = 5,
    PEEP_SPRITE_TYPE_ENTERTAINER_ELEPHANT  = 6,
    PEEP_SPRITE_TYPE_ENTERTAINER_ROMAN     = 7,
    PEEP_SPRITE_TYPE_ENTERTAINER_GORILLA   = 8,
    PEEP_SPRITE_TYPE_ENTERTAINER_SNOWMAN   = 9,
    PEEP_SPRITE_TYPE_ENTERTAINER_KNIGHT    = 10,
    PEEP_SPRITE_TYPE_ENTERTAINER_ASTRONAUT = 11,
    PEEP_SPRITE_TYPE_ENTERTAINER_BANDIT    = 12,
    PEEP_SPRITE_TYPE_ENTERTAINER_SHERIFF   = 13,
    PEEP_SPRITE_TYPE_ENTERTAINER_PIRATE    = 14,
    PEEP_SPRITE_TYPE_ICE_CREAM             = 15,
    PEEP_SPRITE_TYPE_CHIPS                 = 16,
    PEEP_SPRITE_TYPE_BURGER                = 17,
    PEEP_SPRITE_TYPE_DRINK                 = 18,
    PEEP_SPRITE_TYPE_BALLOON               = 19,
    PEEP_SPRITE_TYPE_CANDYFLOSS            = 20,
    PEEP_SPRITE_TYPE_UMBRELLA              = 21,
    PEEP_SPRITE_TYPE_PIZZA                 = 22,
    PEEP_SPRITE_TYPE_SECURITY_ALT          = 23,
    PEEP_SPRITE_TYPE_POPCORN               = 24,
    PEEP_SPRITE_TYPE_ARMS_CROSSED          = 25,
    PEEP_SPRITE_TYPE_HEAD_DOWN             = 26,
    PEEP_SPRITE_TYPE_NAUSEOUS              = 27,
    PEEP_SPRITE_TYPE_VERY_NAUSEOUS         = 28,
    PEEP_SPRITE_TYPE_REQUIRE_BATHROOM      = 29,
    PEEP_SPRITE_TYPE_HAT                   = 30,
    PEEP_SPRITE_TYPE_HOT_DOG               = 31,
    PEEP_SPRITE_TYPE_TENTACLE              = 32,
    PEEP_SPRITE_TYPE_TOFFEE_APPLE          = 33,
    PEEP_SPRITE_TYPE_DOUGHNUT                 = 34,
    PEEP_SPRITE_TYPE_COFFEE                = 35,
    PEEP_SPRITE_TYPE_CHICKEN               = 36,
    PEEP_SPRITE_TYPE_LEMONADE              = 37,
    PEEP_SPRITE_TYPE_WATCHING              = 38,
    PEEP_SPRITE_TYPE_PRETZEL               = 39,
    PEEP_SPRITE_TYPE_SUNGLASSES            = 40,
    PEEP_SPRITE_TYPE_SU_JONGKWA            = 41,
    PEEP_SPRITE_TYPE_JUICE                 = 42,
    PEEP_SPRITE_TYPE_FUNNEL_CAKE           = 43,
    PEEP_SPRITE_TYPE_NOODLES               = 44,
    PEEP_SPRITE_TYPE_SAUSAGE               = 45,
    PEEP_SPRITE_TYPE_SOUP                  = 46,
    PEEP_SPRITE_TYPE_SANDWICH              = 47,
    PEEP_SPRITE_TYPE_COUNT
};

// Flags used by peep->window_invalidate_flags
enum PEEP_INVALIDATE
{
    PEEP_INVALIDATE_PEEP_THOUGHTS  = 1,
    PEEP_INVALIDATE_PEEP_STATS     = 1 << 1,
    PEEP_INVALIDATE_PEEP_2         = 1 << 2,
    PEEP_INVALIDATE_PEEP_INVENTORY = 1 << 3,
    PEEP_INVALIDATE_STAFF_STATS    = 1 << 4,
};

// Flags used by peep_should_go_on_ride()
enum PEEP_RIDE_DECISION
{
    PEEP_RIDE_DECISION_AT_QUEUE = 1,
    PEEP_RIDE_DECISION_THINKING = 1 << 2
};

#pragma pack(push, 1)
struct rct_peep_thought
{
    uint8_t type;  // 0
    uint8_t item;  // 1
    uint8_t freshness; // 2 larger is less fresh
    uint8_t fresh_timeout; // 3 updates every tick
};
assert_struct_size(rct_peep_thought, 4);

struct rct_peep
{
    uint8_t  sprite_identifier; // 0x00
    uint8_t  misc_identifier;         // 0x01
    uint16_t next_in_quadrant;        // 0x02
    uint16_t next;                    // 0x04
    uint16_t previous;                // 0x06
    uint8_t  linked_list_type_offset; // 0x08 Valid values are SPRITE_LINKEDLIST_OFFSET_...
    // Height from centre of sprite to bottom
    uint8_t  sprite_height_negative; // 0x09
    uint16_t sprite_index;           // 0x0A
    uint16_t flags;                  // 0x0C
    int16_t x;                      // 0x0E
    int16_t y;                      // 0x10
    int16_t z;                      // 0x12
    // Width from centre of sprite to edge
    uint8_t sprite_width; // 0x14
    // Height from centre of sprite to top
    uint8_t         sprite_height_positive; // 0x15
    int16_t        sprite_left;            // 0x16
    int16_t        sprite_top;             // 0x18
    int16_t        sprite_right;           // 0x1A
    int16_t        sprite_bottom;          // 0x1C
    uint8_t         sprite_direction;       // 0x1E
    uint8_t         pad_1F[3];
    rct_string_id name_string_idx; // 0x22
    uint16_t        next_x;          // 0x24
    uint16_t        next_y;          // 0x26
    uint8_t         next_z;          // 0x28
    uint8_t         next_flags;     // 0x29
    uint8_t         outside_of_park; // 0x2A
    uint8_t         state;           // 0x2B
    uint8_t         sub_state;       // 0x2C
    uint8_t         sprite_type;     // 0x2D
    uint8_t         type;            // 0x2E
    union {
        uint8_t staff_type;  // 0x2F
        uint8_t no_of_rides; // 0x2F
    };
    uint8_t   tshirt_colour;         // 0x30
    uint8_t   trousers_colour;       // 0x31
    uint16_t  destination_x;         // 0x32 Location that the peep is trying to get to
    uint16_t  destination_y;         // 0x34
    uint8_t   destination_tolerance; // 0x36 How close to destination before next action/state 0 = exact
    uint8_t   var_37;
    uint8_t   energy;           // 0x38
    uint8_t   energy_target;    // 0x39
    uint8_t   happiness;        // 0x3A
    uint8_t   happiness_target; // 0x3B
    uint8_t   nausea;           // 0x3C
    uint8_t   nausea_target;    // 0x3D
    uint8_t   hunger;           // 0x3E
    uint8_t   thirst;           // 0x3F
    uint8_t   toilet;           // 0x40
    uint8_t   mass;             // 0x41
    uint8_t   time_to_consume;  // 0x42
    uint8_t   intensity; // 0x43 The max intensity is stored in the first 4 bits, and the min intensity in the second 4 bits
    uint8_t   nausea_tolerance;        // 0x44
    uint8_t   window_invalidate_flags; // 0x45
    money16 paid_on_drink;           // 0x46
    uint8_t   ride_types_been_on[16];  // 0x48
    uint32_t  item_extra_flags;        // 0x58
    uint8_t   photo2_ride_ref;         // 0x5C
    uint8_t   photo3_ride_ref;         // 0x5D
    uint8_t   photo4_ride_ref;         // 0x5E
    uint8_t   pad_5F[0x09];            // 0x5F
    uint8_t   current_ride;            // 0x68
    uint8_t   current_ride_station;    // 0x69
    uint8_t   current_train;           // 0x6A
    union {
        struct
        {
            uint8_t current_car;  // 0x6B
            uint8_t current_seat; // 0x6C
        };
        uint16_t time_to_sitdown; // 0x6B
        struct
        {
            uint8_t time_to_stand;  // 0x6B
            uint8_t standing_flags; // 0x6C
        };
    };
    // Normally 0, 1 for carrying sliding board on spiral slide ride, 2 for carrying lawn mower
    uint8_t special_sprite;     // 0x6D
    uint8_t action_sprite_type; // 0x6E
    // Seems to be used like a local variable, as it's always set before calling SwitchNextActionSpriteType, which
    // reads this again
    uint8_t next_action_sprite_type;    // 0x6F
    uint8_t action_sprite_image_offset; // 0x70
    uint8_t action;                     // 0x71
    uint8_t action_frame;               // 0x72
    uint8_t step_progress;              // 0x73
    union {
        uint16_t mechanic_time_since_call;  // time getting to ride to fix
        uint16_t next_in_queue; // 0x74
    };
    uint8_t pad_76; // Previously this was set to 0 but never used.
    uint8_t pad_77;
    union {
        uint8_t maze_last_edge; // 0x78
        uint8_t direction;      // Direction ?
    };
    uint8_t  interaction_ride_index;
    uint16_t time_in_queue;     // 0x7A
    uint8_t  rides_been_on[32]; // 0x7C
    // 255 bit bitmap of every ride the peep has been on see
    // window_peep_rides_update for how to use.
    uint32_t           id;                          // 0x9C
    money32          cash_in_pocket;              // 0xA0
    money32          cash_spent;                  // 0xA4
    int32_t           time_in_park;                // 0xA8
    int8_t            rejoin_queue_timeout;        // 0xAC whilst waiting for a free vehicle (or pair) in the entrance
    uint8_t            previous_ride;               // 0xAD
    uint16_t           previous_ride_time_out;      // 0xAE
    rct_peep_thought thoughts[PEEP_MAX_THOUGHTS]; // 0xB0
    uint8_t            path_check_optimisation;     // 0xC4 see peep.checkForPath
    union {
        uint8_t staff_id;                 // 0xC5
        uint8_t guest_heading_to_ride_id; // 0xC5
    };
    union {
        uint8_t staff_orders;           // 0xC6
        uint8_t peep_is_lost_countdown; // 0xC6
    };
    uint8_t     photo1_ride_ref;     // 0xC7
    uint32_t    peep_flags;          // 0xC8
    rct12_xyzd8 pathfind_goal;       // 0xCC
    rct12_xyzd8 pathfind_history[4]; // 0xD0
    uint8_t     no_action_frame_num;  // 0xE0
    // 0x3F Litter Count split into lots of 3 with time, 0xC0 Time since last recalc
    uint8_t litter_count; // 0xE1
    union {
        uint8_t time_on_ride; // 0xE2
        uint8_t staff_mowing_timeout;       // 0xE2
    };
    // 0x3F Sick Count split into lots of 3 with time, 0xC0 Time since last recalc
    uint8_t disgusting_count; // 0xE3
    union {
        money16 paid_to_enter;     // 0xE4
        uint16_t  staff_lawns_mown;  // 0xE4
        uint16_t  staff_rides_fixed; // 0xE4
    };
    union {
        money16 paid_on_rides;         // 0xE6
        uint16_t  staff_gardens_watered; // 0xE6
        uint16_t  staff_rides_inspected; // 0xE6
    };
    union {
        money16 paid_on_food;       // 0xE8
        uint16_t  staff_litter_swept; // 0xE8
    };
    union {
        money16 paid_on_souvenirs;  // 0xEA
        uint16_t  staff_bins_emptied; // 0xEA
    };
    uint8_t  no_of_food;      // 0xEC
    uint8_t  no_of_drinks;    // 0xED
    uint8_t  no_of_souvenirs; // 0xEE
    uint8_t  vandalism_seen;  // 0xEF 0xC0 vandalism thought timeout, 0x3F vandalism tiles seen
    uint8_t  voucher_type;      // 0xF0
    uint8_t  voucher_arguments; // 0xF1 ride_id or string_offset_id
    uint8_t  surroundings_thought_timeout; // 0xF2
    uint8_t  angriness;             // 0xF3
    uint8_t  time_lost;             // 0xF4 the time the peep has been lost when it reaches 254 generates the lost thought
    uint8_t  days_in_queue;         // 0xF5
    uint8_t  balloon_colour;        // 0xF6
    uint8_t  umbrella_colour;       // 0xF7
    uint8_t  hat_colour;            // 0xF8
    uint8_t  favourite_ride;        // 0xF9
    uint8_t  favourite_ride_rating; // 0xFA
    uint8_t  pad_FB;
    uint32_t item_standard_flags; // 0xFC

public: // Peep
    void Update();
    bool UpdateAction(int16_t * actionX, int16_t * actionY, int16_t * xy_distance);
    bool UpdateAction();
    void SetState(uint8_t new_state);
    void Remove();
    void Invalidate();
    void UpdateCurrentActionSpriteType();
    void SwitchToSpecialSprite(uint8_t special_sprite_id);
    void StateReset();
    void MoveTo(int16_t destX, int16_t destY, int16_t destZ);
    uint8_t GetNextDirection() const;
    bool GetNextIsSloped() const;
    bool GetNextIsSurface() const;
    void SetNextFlags(uint8_t next_direction, bool is_sloped, bool is_surface);
    void Pickup();
    void PickupAbort(int32_t old_x);
    bool Place(TileCoordsXYZ location, bool apply);
public: // Guest
    void Tick128UpdateGuest(int32_t index);
    void RemoveFromQueue();
    bool HasItem(int32_t peepItem) const;
    bool HasFood() const;
    bool HasDrink() const;
    bool HasEmptyContainer() const;
    void OnEnterRide(uint8_t rideIndex);
    void OnExitRide(uint8_t rideIndex);
    void RemoveFromRide();
    void UpdateSpriteType();
    bool HeadingForRideOrParkExit() const;
public: // Staff
    void Tick128UpdateStaff();
    bool IsMechanic() const;

private: // Peep update
    void UpdateFalling();
    void Update1();
    void UpdatePicked();
private: // Guest update
    void UpdateRide();
    void UpdateOnRide() {}; // TODO
    void UpdateWalking();
    void UpdateQueuing();
    void UpdateSitting();
    void UpdateEnteringPark();
    void UpdateLeavingPark();
    void UpdateBuying();
    void UpdateWatching();
    void UpdateUsingBin();
    void UpdateRideAtEntrance();
    void UpdateRideAdvanceThroughEntrance();
    void UpdateRideFreeVehicleCheck();
    void UpdateRideFreeVehicleEnterRide(Ride * ride);
    void UpdateRideApproachVehicle();
    void UpdateRideEnterVehicle();
    void UpdateRideLeaveVehicle();
    void UpdateRideApproachExit();
    void UpdateRideInExit();
    void UpdateRideApproachVehicleWaypoints();
    void UpdateRideApproachExitWaypoints();
    void UpdateRideApproachSpiralSlide();
    void UpdateRideOnSpiralSlide();
    void UpdateRideLeaveSpiralSlide();
    void UpdateRideMazePathfinding();
    void UpdateRideLeaveExit();
    void UpdateRideShopApproach();
    void UpdateRideShopInteract();
    void UpdateRideShopLeave();
private: // Staff update
    void UpdatePatrolling();
    void UpdateMowing();
    void UpdateSweeping();
    void UpdateEmptyingBin();
    void UpdateWatering();
    void UpdateAnswering();
    void UpdateFixing(int32_t steps);
    bool UpdateFixingEnterStation(Ride * ride);
    bool UpdateFixingMoveToBrokenDownVehicle(bool firstRun, Ride * ride);
    bool UpdateFixingFixVehicle(bool firstRun, Ride * ride);
    bool UpdateFixingFixVehicleMalfunction(bool firstRun, Ride * ride);
    bool UpdateFixingMoveToStationEnd(bool firstRun, Ride * ride);
    bool UpdateFixingFixStationEnd(bool firstRun);
    bool UpdateFixingMoveToStationStart(bool firstRun, Ride * ride);
    bool UpdateFixingFixStationStart(bool firstRun, Ride * ride);
    bool UpdateFixingFixStationBrakes(bool firstRun, Ride * ride);
    bool UpdateFixingMoveToStationExit(bool firstRun, Ride * ride);
    bool UpdateFixingFinishFixOrInspect(bool firstRun, int32_t steps, Ride * ride);
    bool UpdateFixingLeaveByEntranceExit(bool firstRun, Ride * ride);
    void UpdateRideInspected(int32_t rideIndex);
    void UpdateHeadingToInspect();

    // TODO: Make these private again when done refactoring
public: // Peep
    bool   CheckForPath();
    void   PerformNextAction(uint8_t & pathing_result);
    void   PerformNextAction(uint8_t & pathing_result, rct_tile_element *& tile_result);
    int32_t GetZOnSlope(int32_t tile_x, int32_t tile_y);
    void   SwitchNextActionSpriteType();
    uint8_t  GetActionSpriteType();

public: // Guest
    void   StopPurchaseThought(uint8_t ride_type);
    void   TryGetUpFromSitting();
    void   ChoseNotToGoOnRide(int32_t rideIndex, bool peepAtRide, bool updateLastRide);
    void   PickRideToGoOn();
    void   ReadMap();
    bool   ShouldGoOnRide(int32_t rideIndex, int32_t entranceNum, bool atQueue, bool thinking);
    bool   ShouldGoToShop(int32_t rideIndex, bool peepAtShop);
    bool   ShouldFindBench();
    bool   UpdateWalkingFindBench();
    bool   UpdateWalkingFindBin();
    void   SpendMoney(money16 & peep_expend_type, money32 amount);
    void   SpendMoney(money32 amount);
    void   SetHasRidden(int32_t rideIndex);
    bool   HasRidden(int32_t rideIndex) const;
    void   SetHasRiddenRideType(int32_t rideType);
    bool   HasRiddenRideType(int32_t rideType) const;
    int32_t HasFoodStandardFlag() const;
    int32_t HasFoodExtraFlag() const;
    bool   HasDrinkStandardFlag() const;
    bool   HasDrinkExtraFlag() const;
    int32_t HasEmptyContainerStandardFlag() const;
    int32_t HasEmptyContainerExtraFlag() const;
    void   CheckIfLost();
    void   CheckCantFindRide();
    void   CheckCantFindExit();
    bool   DecideAndBuyItem(uint8_t rideIndex, int32_t shopItem, money32 price);
    void   SetSpriteType(uint8_t new_sprite_type);
};
assert_struct_size(rct_peep, 0x100);
#pragma pack(pop)

struct rct_sprite_bounds
{
    uint8_t sprite_width;           // 0x00
    uint8_t sprite_height_negative; // 0x01
    uint8_t sprite_height_positive; // 0x02
};

struct rct_peep_animation
{
    uint32_t        base_image; // 0x00
    size_t        num_frames;
    const uint8_t * frame_offsets;
};

struct rct_peep_animation_entry
{
    const rct_peep_animation * sprite_animation; // 0x00
    const rct_sprite_bounds *  sprite_bounds;    // 0x04
};

enum
{
    EASTEREGG_PEEP_NAME_MICHAEL_SCHUMACHER,
    EASTEREGG_PEEP_NAME_JACQUES_VILLENEUVE,
    EASTEREGG_PEEP_NAME_DAMON_HILL,
    EASTEREGG_PEEP_NAME_MR_BEAN,
    EASTEREGG_PEEP_NAME_CHRIS_SAWYER,
    EASTEREGG_PEEP_NAME_KATIE_BRAYSHAW,
    EASTEREGG_PEEP_NAME_MELANIE_WARN,
    EASTEREGG_PEEP_NAME_SIMON_FOSTER,
    EASTEREGG_PEEP_NAME_JOHN_WARDLEY,
    EASTEREGG_PEEP_NAME_LISA_STIRLING,
    EASTEREGG_PEEP_NAME_DONALD_MACRAE,
    EASTEREGG_PEEP_NAME_KATHERINE_MCGOWAN,
    EASTEREGG_PEEP_NAME_FRANCES_MCGOWAN,
    EASTEREGG_PEEP_NAME_CORINA_MASSOURA,
    EASTEREGG_PEEP_NAME_CAROL_YOUNG,
    EASTEREGG_PEEP_NAME_MIA_SHERIDAN,
    EASTEREGG_PEEP_NAME_KATIE_RODGER,
    EASTEREGG_PEEP_NAME_EMMA_GARRELL,
    EASTEREGG_PEEP_NAME_JOANNE_BARTON,
    EASTEREGG_PEEP_NAME_FELICITY_ANDERSON,
    EASTEREGG_PEEP_NAME_KATIE_SMITH,
    EASTEREGG_PEEP_NAME_EILIDH_BELL,
    EASTEREGG_PEEP_NAME_NANCY_STILLWAGON,
